import psycopg2
import sqlalchemy


engine= sqlalchemy.create_engine('postgresql://postgres:q2w3e4r5@localhost:5432/Task3')
connection = engine.connect()

connection.execute("""INSERT INTO track (name,duration,album_id)
                    VALUES('Останусь', 2.5, 1),
                          ('Поговори со мной', 3.0, 1),
                          ('Амигос', 3.2,	1),
                          ('Цирк', 	2.3,	2),
                          ('Кайф и истерика', 	2.6, 2),
                          ('Охота', 2.9, 2),
                          ('Маникина свадьба', 3.9, 3),
                          ('Остров невезения', 3.4, 3),
                          ('Песенка про аварию', 1.9,	3),
                          ('Между Петербургом и Москвой', 4.0, 4),
                          ('Бабье лето', 3.9,	4),
                          ('Королева Бала',	3.5, 4),
                          ('Туманы-туманы',	2.4, 5),
                          ('Роза и хулиган', 2.2, 5),
                          ('Ах мама мама', 2.4, 5),
                          ('Sing it back', 3.6,	6),
                          ('Don’t speak', 3.5, 6),
                          ('Relax', 3.7, 6),
                          ('Детство', 4.6,	7),
                          ('События', 3.5, 7),
                          ('Пофигу', 3.3,	7),
                          ('Полюби меня', 2.6,	8),
                          ('Песня вольного стрелка', 2.3, 8),
                          (' Дроля', 3.1,	8)
                    
                    ;""")
